app/controllers/constraints_controller.rb

  def index
    @constraints = Constraint.all
---
SELECT * FROM `constraints`

  def show
    @constraint = Constraint.find(params[:id])
---
SELECT * FROM `constraints` WHERE (`constraints`.`id` = 4)

  def edit
    @constraint = Constraint.find(params[:id])
---
SELECT * FROM `constraints` WHERE (`constraints`.`id` = 1)

  def create
    @constraint = Constraint.new(params[:constraint])

    respond_to do |format|
      if @constraint.save
---
INSERT INTO `constraints` (`updated_at`, `title`, `unit`, `value`, `description`, `created_at`) VALUES('2009-11-14 21:09:04', 'Coltan', 'child soldiers', 60.0, 'and what? i want my ipod dammit.', '2009-11-14 21:09:04')