app/controllers/welcome_controller.rb

SELECT * FROM `constraints` LIMIT 1
---
    def index
      @constraints = Constraint.all

SELECT * FROM `constraints` WHERE (`constraints`.`id` = 1)
---
    def show
      @constraint = Constraint.find params[:id]